const services = [
  { id: 1, name: 'Фотографія', price: '1300 грн' },
  { id: 2, name: 'Відео', price: '1900 грн' },
  { id: 3, name: 'Монтаж', price: '1500 грн' },
  { id: 4, name: 'Фотомонтаж', price: '1700 грн' },
  { id: 5, name: 'Відеомонтаж', price: '1800 грн' },
  { id: 6, name: 'Накладення спецефектів', price: '900 грн' },
  { id: 7, name: 'Редагування фото', price: '500 грн' },
  { id: 8, name: 'Редагування відео', price: '1200 грн' },
  { id: 9, name: 'Фотоколаж', price: '800 грн' },
  { id: 10, name: 'Друк фото', price: '300 грн' },
  { id: 11, name: 'Тривале відео', price: '1200 грн' },
  { id: 12, name: 'Оренда фотостудії', price: '1700 грн' },
  { id: 13, name: 'Фотофільтрація', price: '1300 грн' },
  { id: 14, name: 'Фото на вулиці', price: '1900 грн' },
  { id: 15, name: 'Фото в студії', price: '2000 грн' },
  { id: 16, name: 'Відео на весілля', price: '23000 грн' },
  { id: 17, name: 'Інтерактивне відео', price: '1700 грн' },
  { id: 18, name: 'Корпоративне відео', price: '23999 грн' },
  { id: 19, name: 'Відео для закладів освіти', price: '12000 грн' },
  { id: 20, name: 'Промовідео', price: '14900 грн' },
  { id: 21, name: 'Відео візитка', price: '6000 грн' },
  { id: 22, name: 'Довготривала зйомка', price: '14200 грн' },
  { id: 23, name: 'Відео для фотостудії', price: '5500 грн' },
  { id: 24, name: 'Інші послуги', price: 'Ціна за запитом' },
];

export const fetchServices = () => {
  return new Promise((resolve) => {
    setTimeout(() => {
      resolve(services);
    }, 1000);
  });
};
