const services = [
  {
    id: 1,
    name: 'Фотографія',
    description:
      'Професійна фотозйомка, включаючи портрети, весільну зйомку та інші події.',
    price: '1300 грн',
    category: 'Фотографія',
  },
  {
    id: 2,
    name: 'Відео',
    description:
      'Відеозйомка подій, включаючи весільні церемонії, корпоративи та інші заходи.',
    price: '1900 грн',
    category: 'Відео',
  },
  {
    id: 3,
    name: 'Монтаж',
    description:
      'Професійний монтаж відео, включаючи редагування та обробку відеоматеріалу.',
    price: '1500 грн',
    category: 'Відео',
  },
  {
    id: 4,
    name: 'Фотомонтаж',
    description:
      'Створення композицій з декількох фотографій, з використанням графічних ефектів.',
    price: '1700 грн',
    category: 'Фотографія',
  },
  {
    id: 5,
    name: 'Відеомонтаж',
    description: 'Монтаж відео з добавленням спеціальних ефектів та переходів.',
    price: '1800 грн',
    category: 'Відео',
  },
  {
    id: 6,
    name: 'Накладення спецефектів',
    description:
      'Додавання спецефектів до відеоматеріалів, щоб зробити їх більш привабливими.',
    price: '900 грн',
    category: 'Відео',
  },
  {
    id: 7,
    name: 'Редагування фото',
    description:
      'Професійне редагування фотографій, включаючи кольорокорекцію та ретуш.',
    price: '500 грн',
    category: 'Фотографія',
  },
  {
    id: 8,
    name: 'Редагування відео',
    description: 'Редагування та покращення якості відеоматеріалів.',
    price: '1200 грн',
    category: 'Відео',
  },
  {
    id: 9,
    name: 'Фотоколаж',
    description: 'Створення колажів з фотографій, що розповідають історію.',
    price: '800 грн',
    category: 'Фотографія',
  },
  {
    id: 10,
    name: 'Друк фото',
    description: 'Друк фотографій різних форматів на якісному папері.',
    price: '300 грн',
    category: 'Фотографія',
  },
  {
    id: 11,
    name: 'Тривале відео',
    description:
      'Запис тривалого відео з подій, таких як концерти чи спортивні змагання.',
    price: '1200 грн',
    category: 'Відео',
  },
  {
    id: 12,
    name: 'Оренда фотостудії',
    description: 'Оренда професійної фотостудії з необхідним обладнанням.',
    price: '1700 грн',
    category: 'Фотографія',
  },
  {
    id: 13,
    name: 'Фотофільтрація',
    description: 'Фільтрація фотографій для підвищення їхньої естетики.',
    price: '1300 грн',
    category: 'Фотографія',
  },
  {
    id: 14,
    name: 'Фото на вулиці',
    description: 'Зйомка фотографій на вулиці, в природі або в міських умовах.',
    price: '1900 грн',
    category: 'Фотографія',
  },
  {
    id: 15,
    name: 'Фото в студії',
    description:
      'Професійна фотозйомка в студії з використанням професійного обладнання.',
    price: '2000 грн',
    category: 'Фотографія',
  },
  {
    id: 16,
    name: 'Відео на весілля',
    description: 'Професійна відеозйомка весільних церемоній з монтажем.',
    price: '23000 грн',
    category: 'Відео',
  },
  {
    id: 17,
    name: 'Інтерактивне відео',
    description:
      'Створення інтерактивних відео, які дозволяють глядачеві взаємодіяти з контентом.',
    price: '1700 грн',
    category: 'Відео',
  },
  {
    id: 18,
    name: 'Корпоративне відео',
    description:
      'Зйомка корпоративних заходів та створення рекламних відео для бізнесу.',
    price: '23999 грн',
    category: 'Відео',
  },
  {
    id: 19,
    name: 'Відео для закладів освіти',
    description:
      'Створення навчальних відео для шкіл, університетів та курсів.',
    price: '12000 грн',
    category: 'Відео',
  },
  {
    id: 20,
    name: 'Промовідео',
    description: 'Створення промоційних відео для продуктів або послуг.',
    price: '14900 грн',
    category: 'Відео',
  },
  {
    id: 21,
    name: 'Відео візитка',
    description: 'Коротке відео для представлення компанії або особи.',
    price: '6000 грн',
    category: 'Відео',
  },
  {
    id: 22,
    name: 'Довготривала зйомка',
    description: 'Зйомка подій протягом тривалого часу з подальшою обробкою.',
    price: '14200 грн',
    category: 'Відео',
  },
  {
    id: 23,
    name: 'Відео для фотостудії',
    description: 'Створення рекламних відео для фотостудій.',
    price: '5500 грн',
    category: 'Відео',
  },
  {
    id: 24,
    name: 'Інші послуги',
    description:
      'Ціна за запитом. Інші послуги, що не входять до основних категорій.',
    price: 'Ціна за запитом',
    category: 'Інші',
  },
];

export const fetchServices = () => {
  return new Promise((resolve) => {
    setTimeout(() => {
      resolve(services);
    }, 1000);
  });
};
